# go-exercises

This repository contains all of the exercises with __Go__ porgramming language and __Git__.

<details>
<summary>exercise-one</summary>

* Enter in the hello folder
* Run the programm _hello.go_
* Type in the terminal the following commands and "Hello World" will be printed as a result
```bash
cd hello
go run .
> Hello, World
```
</details>

<details>
<summary>exercise-two</summary>

* Enter in the function folder
* Run the programm _function.go_
* Type in the terminal the following commands and "Hello World" alongside with "12" will be printed as results
```bash
cd function
go run function.go
> Hello, World
> 12
```
<details>
<summary>bonus</summary>

* Enter in the function-bonus folder
* Run the programm _function-bonus.go_
* Type in the terminal the following commands and "Your result is" alongside with the sum of the two numbers you chose will be printed as results
```bash
cd function-bonus
go run function-bonus.go
> Type a number 
> Type an other number
> Your result is <sum>
```
</details>

<details>
<summary>bonus-bonus</summary>

* Enter in the bonus-bonus-ex-2 folder
* Run the programm _bonus-bonus-ex-2.go_
* Type in the terminal the following commands and "Your result is" alongside with the result of the operation you chose will be printed
* If you use invalid operators this message will appear: `Operation not supported`
```bash
cd bonus-bonus-ex-2
go run bonus-bonus-ex-2.go
> Type a number 
> Choose an operator
> Type an other number
> Your result is <num>
```
</details>

<details>
<summary>3bonus</summary>

* Enter in the 3b-switch folder
* Run the programm _3b-switch.go_
* Type in the terminal the following commands and it will be print the full operation alongside with its result 
* If you type 0 when the programm asks the number of number this message will appear: `No operation required`
* If you use invalid operators this message will appear: `Operation not supported`
* If you choose 0 as a number in the division then you will recieve an error: date time `Operation not supported`
```bash
cd 3b-ex-2
go 3b-ex-2.go
> Type a number 
> Choose an operator
> Type an other number
> ...
```
</details>

</details>